tap "buo/cask-upgrade"
tap "eugenmayer/dockersync"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "twpayne/taps"
brew "adminer"
brew "autoconf"
brew "bash"
brew "flake8"
brew "fswatch"
brew "geoip"
brew "graphicsmagick"
brew "imagemagick"
brew "jpegoptim"
brew "mariadb"
brew "memcached"
brew "npm"
brew "optipng"
brew "tidy-html5"
brew "php-code-sniffer"
brew "phplint"
brew "phpmd"
brew "phpunit"
brew "pipenv"
brew "platformio"
brew "postgresql", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "rsync"
brew "telnet"
brew "travis"
brew "unison"
brew "wget"
brew "zlib"
brew "eugenmayer/dockersync/unox"
brew "heroku/brew/heroku"
brew "twpayne/taps/chezmoi"
cask "android-platform-tools"
cask "powershell"
