# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or `~/dotfiles.sh`.
#
# See https://github.com/Homebrew/homebrew-bundle

tap "buo/cask-upgrade"
tap "eugenmayer/dockersync"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "twpayne/taps"

brew "adminer"
brew "autoconf"
brew "bash"
brew "bash_completion"
brew "colordiff"
brew "direnv"
brew "flake8"
brew "fswatch"
brew "geoip"
brew "htop"
#brew "graphicsmagick"
#brew "imagemagick"
brew "jpegoptim"
brew "mariadb"
brew "npm"
#brew "optipng"
brew "tidy-html5"
brew "neofetch"
brew "php-code-sniffer"
brew "phplint"
brew "phpmd"
brew "phpunit"
brew "pipenv"
brew "postgresql", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rsync"
brew "screenfetch"
brew "starship"
brew "telnet"
brew "travis"
brew "unison"
brew "wget"
brew "zlib"
brew "eugenmayer/dockersync/unox"
brew "heroku/brew/heroku"
brew "twpayne/taps/chezmoi"

cask "android-platform-tools"
cask "font-dejavusansmono-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-meslo-nerd-font-mono"
cask "font-sourcecodepro-nerd-font-mono"
cask "powershell"
